tutorials/multiphase/potentialFreeSurfaceFoam/oscillatingBox/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    freeSurface
    {
        type            pressureInletOutletParSlipVelocity;
        value           uniform (0 0 0);
    }

    walls
    {
        type            noSlip;
    }

    floatingObject
    {
        type            fixedNormalInletOutletVelocity;
        fixTangentialInflow false;
        normalVelocity
        {
            type            uniformFixedValue;

            uniformValue
            {
                type        scale;
                value
                {
                    type        sine;
                    frequency   1;
                    amplitude   0.025;
                    scale       (0 1 0);
                    level       (0 0 0);
                }
                scale
                {
                    type linearRamp;
                    duration 10;
                }
            }
        }
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
